{"_id":{"$oid":"611bd09659f7b8323ad90432"},"Name":"Viggo Mortensen","Bio":"Viggo Peter Mortensen Jr. is an American actor, author, musician, photographer, poet, and painter. Born in New York to a Danish father and American mother, he lived in Argentina during his childhood.","Birth":"1958-10-20","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90433"},"Name":"Ian Mckellen","Bio":"Sir Ian Murray McKellen CH CBE is an English actor. His career spans six decades, having performed in genres ranging from Shakespearean and modern theatre to popular fantasy and science fiction.","Birth":"1939-05-25","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90434"},"Name":"Elijah Wood","Bio":"Elijah Wood is an American actor and producer. He is best known for his portrayal of Frodo Baggins in the Lord of the Rings film trilogy and The Hobbit: An Unexpected Journey. Wood made his film debut with a small part in Back to the Future Part II.","Birth":"1981-01-28","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90435"},"Name":"Orlando Bloom","Bio":"Orlando Jonathan Blanchard Copeland Bloom is an English actor. He made his breakthrough as the character Legolas in The Lord of the Rings film series, a role he reprised in The Hobbit film series.","Birth":"1977-01-13","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90436"},"Name":"Sean Bean","Bio":"Shaun Mark 'Sean' Bean is an English actor. After graduating from the Royal Academy of Dramatic Art, Bean made his professional debut in a theatre production of Romeo and Juliet in 1983.","Birth":"1959-04-17","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90437"},"Name":"Martin Freeman","Bio":"Martin John Christopher Freeman is an English actor. Among other accolades, he has won an Emmy Award, a BAFTA Award and a Screen Actors Guild Award, and has been nominated for a Golden Globe Award.","Birth":"1971-09-08","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90438"},"Name":"Daniel Radcliffe","Bio":"Daniel Jacob Radcliffe is an English actor, best known for playing Harry Potter in the Harry Potter film series. Born and raised in London, Radcliffe made his acting debut at age 10 in the BBC One television film David Copperfield, followed by his feature film debut in The Tailor of Panama.","Birth":"1989-07-23"}
{"_id":{"$oid":"611bd09659f7b8323ad90439"},"Name":"Emma Watson","Bio":"Emma Charlotte Duerre Watson is an English actress and activist. She has gained recognition for her roles in both blockbusters and independent films, as well as her women's rights work.","Birth":"1990-04-15","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad9043a"},"Name":"Rupert Grint","Bio":"Rupert Alexander Lloyd Grint is an English actor. He rose to fame for his role as Ron Weasley, one of the three main characters in the Harry Potter film series. Grint was cast as Ron at age eleven, having previously acted only in school plays and at his local theatre group.","Birth":"1988-08-24","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad9043b"},"Name":"Christian Bale","Bio":"Christian Charles Philip Bale is an English actor. Known for his versatility and recurring physical transformations to play his roles, he has been a leading man in films of several genres. Bale is a recipient of several accolades, including an Academy Award and two Golden Globe Awards.","Birth":"1974-01-30","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad9043c"},"Name":"Morgan Freeman","Bio":"Morgan Freeman is an American actor, director, and narrator. He has appeared in a range of film genres portraying character roles and is particularly known for his distinctive deep voice. Freeman is the recipient of various accolades, including an Academy Award, a Golden Globe Award, and a Screen Actors Guild Award.","Birth":"1937-06-01","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad9043d"},"Name":"Michael Caine","Bio":"Sir Michael Caine CBE is an English actor. Known for his distinctive South London accent, he has appeared in more than 130 films during a career spanning over 60 years, and is considered a British film icon. As of February 2017, the films in which he has appeared have grossed over $7.8 billion worldwide.","Birth":"1933-03-14","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad9043e"},"Name":"Mark Hamill","Bio":"Mark Richard Hamill is an American actor, voice actor, and writer. He is known for playing Luke Skywalker in the Star Wars film series, winning three Saturn Awards for the role. His other film appearances include Corvette Summer and The Big Red One.","Birth":"1951-09-25","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad9043f"},"Name":"Carrie Fisher","Bio":"Carrie Frances Fisher was an American actress and writer. Fisher was best known for playing Princess Leia in the Star Wars films, a role for which she was nominated for four Saturn Awards.","Birth":"1956-10-21","Death":"2016-12-27"}
{"_id":{"$oid":"611bd09659f7b8323ad90440"},"Name":"Harrison Ford","Bio":"Harrison Ford is an American actor, pilot, and environmental activist. As of 2020, the U.S. domestic box office grosses of his films total over $5.4 billion, with worldwide grosses surpassing $9.3 billion, placing him at No. 7 on the list of highest-grossing domestic box office stars of all time.","Birth":"1942-07-13","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90441"},"Name":"Johnny Depp","Bio":"John Christopher Depp II is an American actor, producer, and musician. He is the recipient of various accolades, including a Golden Globe Award and a Screen Actors Guild Award, in addition to nominations for three Academy Awards and two British Academy Film Awards.","Birth":"1963-06-09","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90442"},"Name":"Keira Knightley","Bio":"Keira Christina Knightley OBE is a British actress. She has starred in both independent films and big-budget blockbusters, and is particularly noted for her roles in period dramas.","Birth":"1985-03-26","Death":"N/A"}
{"_id":{"$oid":"611bd09659f7b8323ad90443"},"Name":"Jared Leto","Bio":"Jared Joseph Leto is an American actor and musician. After starting his career with television appearances in the early 1990s, Leto achieved recognition for his role as Jordan Catalano on the television series My So-Called Life.","Birth":"1971-12-26","Death":"N/A"}
{"_id":{"$oid":"611bd24959f7b8323ad90444"},"Name":"Leonardo DiCaprio","Bio":"Leonardo Wilhelm DiCaprio is an American actor, film producer, and environmentalist. He has played unconventional roles, usually in biopics and period films. As of 2019, his films have grossed $7.2 billion worldwide, and he placed eight times in annual rankings of the world's highest-paid actors.","Birth":"1974-11-11","Death":"N/A"}
