{"_id":{"$oid":"611b4f835bf9b8645dd32efa"},"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson ONZ KNZM is a New Zealand film director, producer, and screenwriter. He is best known as the director, writer, and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkien.","Birth":"1961-10-31","Death":"N/A"}
{"_id":{"$oid":"611b4f835bf9b8645dd32efb"},"Name":"Chris Columbus","Bio":"Chris Joseph Columbus is an American film director, producer, and screenwriter. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"1958-09-10","Death":"N/A"}
{"_id":{"$oid":"611b4f835bf9b8645dd32efc"},"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British-American film director, producer, and screenwriter. His directorial efforts have grossed more than US$5 billion worldwide, garnered 36 Oscar nominations and 11 wins. Born and raised in London, Nolan developed an interest in filmmaking from a young age.","Birth":"1970-07-30","Death":"N/A"}
{"_id":{"$oid":"611b4f835bf9b8645dd32efd"},"Name":"George Lucas","Bio":"George Walton Lucas Jr. is an American film director, producer, screenwriter, and entrepreneur. Lucas is best known for creating the Star Wars and Indiana Jones franchises and founding Lucasfilm, LucasArts, and Industrial Light & Magic.","Birth":"1944-05-14","Death":"N/A"}
{"_id":{"$oid":"611b4f835bf9b8645dd32efe"},"Name":"Gore Verbinski","Bio":"Gregor Justin 'Gore' Verbinski is an American film director, screenwriter, producer, and musician. He is best known for directing The Ring, the Pirates of the Caribbean films, and Rango.","Birth":"1964-03-16","Death":"N/A"}
{"_id":{"$oid":"611b4f835bf9b8645dd32eff"},"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, producer, author, film critic, and actor. His films are characterized by nonlinear storylines, dark humor, stylized violence, extended dialogue, ensemble casts, references to popular culture, alternate history, and neo-noir.","Birth":"1963-03-27","Death":"N/A"}
{"_id":{"$oid":"611b4f835bf9b8645dd32f00"},"Name":"Jaco van Dormael","Bio":"Jaco Van Dormael is a Belgian film director, screenwriter and playwright. His films especially focus on a respectful and sympathetic portrayal of people with mental and physical disabilities.","Birth":"1957-02-09","Death":"N/A"}
