{"_id":{"$oid":"611b4b465bf9b8645dd32ef4"},"Name":"Adventure","Description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. Settings play an important role in adventure films, sometimes as big as the characters themselves."}
{"_id":{"$oid":"611b4b465bf9b8645dd32ef5"},"Name":"Fiction","Description":"Films defined by situations that transcend natural laws and/or by settings inside a fictional universe, with narratives that are often inspired by or involve human myths. The genre typically incorporates non-scientific concepts such as magic, mythical creatures, and supernatural elements."}
{"_id":{"$oid":"611b4b465bf9b8645dd32ef6"},"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap."}
{"_id":{"$oid":"611b4b465bf9b8645dd32ef7"},"Name":"Sci-Fi","Description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."}
{"_id":{"$oid":"611b4b465bf9b8645dd32ef8"},"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."}
{"_id":{"$oid":"611b4b465bf9b8645dd32ef9"},"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."}
