{"_id":{"$oid":"611b50565bf9b8645dd32f01"},"Title":"Lord of the Rings","Description":"Set in mythic pre-historic times, a young hobbit named Frodo Baggins inherits a magic ring from his elderly cousin Bilbo. Wise to the powers that the magic ring holds, the dark Lord Sauron wants it, knowing it will enable him to enslave the people of Middle Earth. In his effort to thwart Sauron, Frodo recruits the fellowship of a wizard, an elf, a dwarf and others on a mission to destroy the ring by casting it into the volcanic fires in the Crack of Doom. However, the ring unleashes its own power as a result of the struggle...","Genre":{"$oid":"611b4b465bf9b8645dd32ef4"},"Director":{"$oid":"611b4f835bf9b8645dd32efa"},"Actors":[{"$oid":"611bd09659f7b8323ad90433"},{"$oid":"611bd09659f7b8323ad90435"},{"$oid":"611bd09659f7b8323ad90432"},{"$oid":"611bd09659f7b8323ad90434"},{"$oid":"611bd09659f7b8323ad90436"}],"ImagePath":"lotr.png","Featured":true}
{"_id":{"$oid":"611b51d75bf9b8645dd32f02"},"Title":"The Hobbit: Desolation of Smaug","Description":"Bilbo (Martin Freeman) and his companions continue their journey east and brave many dangers on their way to the Lonely Mountain, culminating in an encounter with the fearsome dragon Smaug.","Genre":{"$oid":"611b4b465bf9b8645dd32ef4"},"Director":{"$oid":"611b4f835bf9b8645dd32efa"},"Actors":[{"$oid":"611bd09659f7b8323ad90433"},{"$oid":"611bd09659f7b8323ad90435"},{"$oid":"611bd09659f7b8323ad90437"}],"ImagePath":"hobbit.png","Featured":true}
{"_id":{"$oid":"611c06f4cb359ae2b8220240"},"Title":"The Dark Knight","Description":"With the help of allies Lt. Jim Gordon (Gary Oldman) and DA Harvey Dent (Aaron Eckhart), Batman (Christian Bale) has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker (Heath Ledger) suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.","Genre":{"$oid":"611b4b465bf9b8645dd32ef5"},"Director":{"$oid":"611b4f835bf9b8645dd32efc"},"Actors":[{"$oid":"611bd09659f7b8323ad9043b"},{"$oid":"611bd09659f7b8323ad9043c"},{"$oid":"611bd09659f7b8323ad9043d"}],"ImagePath":"DarkKnight.png","Featured":true}
{"_id":{"$oid":"611c06f4cb359ae2b8220241"},"Title":"Inception","Description":"Dom Cobb (Leonardo DiCaprio) is a thief with the rare ability to enter peoples dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someones mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobbs every move.","Genre":{"$oid":"611b4b465bf9b8645dd32ef8"},"Director":{"$oid":"611b4f835bf9b8645dd32efc"},"Actors":[{"$oid":"611bd24959f7b8323ad90444"},{"$oid":"611bd09659f7b8323ad9043d"}],"ImagePath":"inception.png","Featured":true}
{"_id":{"$oid":"611c06f4cb359ae2b8220242"},"Title":"Harry Potter: and the Sorcerer's Stone","Description":"On his 11th birthday, Harry receives a letter inviting him to study magic at the Hogwarts School of Witchcraft and Wizardry. Harry discovers that not only is he a wizard, but he is a famous one. He meets two best friends, Ron Weasley and Hermione Granger, and makes his first enemy, Draco Malfoy.","Genre":{"$oid":"611b4b465bf9b8645dd32ef6"},"Director":{"$oid":"611b4f835bf9b8645dd32efb"},"Actors":[{"$oid":"611bd09659f7b8323ad90438"},{"$oid":"611bd09659f7b8323ad90439"},{"$oid":"611bd09659f7b8323ad9043a"}],"ImagePath":"hp1.png","Featured":false}
{"_id":{"$oid":"611c06f4cb359ae2b8220243"},"Title":"Star Wars: A New Hope","Description":"The Imperial Forces -- under orders from cruel Darth Vader (David Prowse) -- hold Princess Leia (Carrie Fisher) hostage, in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker (Mark Hamill) and Han Solo (Harrison Ford), captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 (Kenny Baker) and C-3PO (Anthony Daniels) to rescue the beautiful princess, help the Rebel Alliance, and restore freedom and justice to the Galaxy.","Genre":{"$oid":"611b4b465bf9b8645dd32ef7"},"Director":{"$oid":"611b4f835bf9b8645dd32efd"},"Actors":[{"$oid":"611bd09659f7b8323ad9043e"},{"$oid":"611bd09659f7b8323ad9043f"},{"$oid":"611bd09659f7b8323ad90440"}],"ImagePath":"starwars4.png","Featured":false}
{"_id":{"$oid":"611c06f4cb359ae2b8220244"},"Title":"Pirates of the Caribbean: The Curse of the Black Pearl","Description":"Capt. Jack Sparrow (Johnny Depp) arrives at Port Royal in the Caribbean without a ship or crew. His timing is inopportune, however, because later that evening the town is besieged by a pirate ship. The pirates kidnap the governor's daughter, Elizabeth (Keira Knightley), who's in possession of a valuable coin that is linked to a curse that has transformed the pirates into the undead. A gallant blacksmith (Orlando Bloom) in love with Elizabeth allies with Sparrow in pursuit of the pirates.","Genre":{"$oid":"611b4b465bf9b8645dd32ef4"},"Director":{"$oid":"611b4f835bf9b8645dd32efe"},"Actors":[{"$oid":"611bd09659f7b8323ad90435"},{"$oid":"611bd09659f7b8323ad90441"},{"$oid":"611bd09659f7b8323ad90442"}],"ImagePath":"pirates1.png","Featured":true}
{"_id":{"$oid":"611c06f4cb359ae2b8220245"},"Title":"Rango","Description":"A chameleon (Johnny Depp) who has lived as a sheltered family pet finds himself in the grip of an identity crisis. Rango wonders how to stand out when it is his nature to blend in. When he accidentally winds up in a frontier town called Dirt, he takes the first step on a transformational journey as the town's new sheriff. Though at first Rango only role-plays, a series of thrilling situations and outrageous encounters forces him to become a real hero.","Genre":{"$oid":"611b4b465bf9b8645dd32ef9"},"Director":{"$oid":"611b4f835bf9b8645dd32efe"},"Actors":[{"$oid":"611bd09659f7b8323ad90441"}],"ImagePath":"rango.png","Featured":false}
{"_id":{"$oid":"611c06f4cb359ae2b8220246"},"Title":"Mr. Nobody","Description":"In 2092 the last mortal human (Jared Leto) on Earth reflects on his long past and thinks about the lives he might have led.","Genre":{"$oid":"611b4b465bf9b8645dd32ef7"},"Director":{"$oid":"611b4f835bf9b8645dd32f00"},"Actors":[{"$oid":"611bd09659f7b8323ad90443"}],"ImagePath":"mrnobody.png","Featured":false}
{"_id":{"$oid":"611c06f4cb359ae2b8220247"},"Title":"Star Wars: Empire Strikes Back","Description":"Luke Skywalker (Mark Hamill), Han Solo (Harrison Ford), Princess Leia (Carrie Fisher) and Chewbacca (Peter Mayhew) face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader (David Prowse).","Genre":{"$oid":"611b4b465bf9b8645dd32ef7"},"Director":{"$oid":"611b4f835bf9b8645dd32efd"},"Actors":[{"$oid":"611bd09659f7b8323ad9043e"},{"$oid":"611bd09659f7b8323ad9043f"},{"$oid":"611bd09659f7b8323ad90440"}],"ImagePath":"starwars4.png","Featured":false}
